In [7]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
             index=['a','b','c'],
             columns=['台北', '台中', '高雄'])
df1.reindex(index=['a','c'],columns=['台北','高雄'])

   台北  高雄
a   0   2
c   6   8

In [8]:
df1

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [9]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
df2

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [11]:
df2.drop(index=['台中','台南'])
df2.drop(index=['台中','台南'],columns=['one','two'])

    three  four
台北      2     3
高雄     14    15